{
    "name": "Soji Oduneye",
    "role": "CS & Music @ Northwestern",
    "bio": "Hi, I’m Soji, a creative engineer passionate about crafting experiences that bring joy, learning, and growth. As a double major in Computer Science and Music at Northwestern University, I thrive at the intersection of technology and art. Whether I’m building software, composing music, or blending the two, my goal is to design meaningful moments for others. From innovative tech solutions to immersive soundscapes, I strive to make the world a more engaging and inspiring place. ",
    "university": "Northwestern University",
    "age" : 21,
    "location": "Evanston, IL",
    "phone": "219-306-6911",
    "email": "soji@u.northwestern.edu",
    "github_handle": "soj-i",
    "experiences" : [
        {
        "year": "August 2024 - Present",
        "title": "Cybersecurity Teaching Assistant",
        "company": "Northwestern University",
        "description": [" Assist in delivering a practical, defense-focused introduction to cybersecurity principles by guiding students through full-stack security practices, covering key topics such as threat modeling, application security, cryptography, and access control, while emphasizing both technical skills and ethical decision-making.",
                        "Provide hands-on support for programming assignments, in-class activities, and timed assessments, helping students apply fundamental security concepts to real-world applications using languages like C, C++, and JavaScript, ensuring they understand secure system design from the ground up.",
                        "Lead discussions, offer personalized feedback, and create an engaging learning environment that prepares students for careers in cybersecurity or equips them with the skills to incorporate foundational security practices into any software or system they develop."
                        ] 
        },
        {
        "year": "June 2024 - Present",
        "title": "Software & Hardware Engineer Intern",
        "company": "Technological Innovations for Inclusive Learning and Teaching Laboratory (tiilt)",
        "description": ["Led development and prototyping of a wearable sensor for ACL recovery, successfully integrating core functionalities to monitor key recovery metrics for athletes and physical therapists.",
        "Researched and selected suitable PCBs and Arduinos, translating high-level code into efficient system-level C code for seamless integration and performance optimization.",
        "Set to contribute to the development of a Swift-based mobile app, planning to incorporate three.js and React frameworks for real-time data visualization and user interaction."
        ]
        },
        {
        "year": "January 2024 - June 2024",
        "title": "Undergraduate Researcher",
        "company": "Tangible Interactions and Design & Learning Laboratory (tidal)",
        "description": ["Conducted research within the CS education program by systematically collecting and analyzing data from classroom interactions and middle school student feedback to refine the curriculum and teaching methodologies, ensuring an effective and engaging learning experience for over 200 elementary students across the district.",
        " Delivered interactive and educational lessons to a class of 20 fifth graders, fostering a creative and supportive environment for learning coding and problem-solving skills."
        ]},
        {
        "year": "May 2023 - Present",
        "title": "Co-Founder of ColorStack at Northwestern",
        "company": "Northwestern University",
        "description": ["Co-founded a chapter of ColorStack, an organization for Black and Latinx students aimed at providing a supportive community and resources for underrepresented minorities in Tech.",
                        "Facilitating mentorship programs, technical workshops, and networking events with over 20 partners to promote the personal and professional development of club members.",
                        "Providing academic and emotional support to 6 first-gen, low-income freshmen in Tech to aid their transition."
        ]},
        {
        "year": "July 2023 - September 2023",
        "title": "Software Engineer Intern",
        "company": "Complear Health",
        "description" :[
        "Developed a chatbot application using Python, LangChain, and Docker to process and analyze company data, automating key processes and improving the company’s workflow and consumer experience.",
        "Leveraged company-provided data to train and fine-tune local large language models, enabling personalized dropdown box options for business partners.",
        "Researched the latest advancements in natural language processing, incorporating relevant techniques into large language model implementation."
        ]
        },
        {
            "year": "June 2023 - July 2023",
        "title": "Software Engineer Fellow",
        "company": "Bloomberg",
        "description" : [
        "Selected by Bloomberg Engineering from competitive applicants to complete software engineering courses.",
        "Actively engaged in specialized workshops on data structures & algorithms, problem-solving & patterns, and live coding sessions with Bloomberg Software Engineers to sharpen technical interview prowess."
        ]
        }
    ],
    "projects": [
    {
      "imageUrl": "/images/Block Music.png",
      "title": "Block Music",
      "url": "https://github.com/hanniavalera/block-music",
      "description": "Block Music is an interactive experience that allows users to create music by physically arranging puzzle pieces that represent various musical pitches and note values. Designed for learners of all ages, the project helps teach the fundamentals of music creation in a hands-on way. I developed backend logic using Python, OpenCV, and Tesseract OCR to interpret and convert the puzzle arrangements into sound. The project was successfully demoed by over 100 elementary and middle school students in Evanston, enhancing their understanding of music and coding through play.",
      "videoUrl": null
    },
    {
    "imageUrl": "/images/todo-title.png",
      "title": "Secure To-Do List",
      "url": "https://www.google.com",
      "description": "This full-stack to-do list application was built using Next.js with a focus on security and scalability. The project integrates Docker to ensure consistent environment configurations and employs advanced security protocols, including cryptographic hashing and token-driven authentication, to protect user data. The application was developed using domain-driven design principles, with seamless backend and frontend integration. Manual testing was implemented for product security, along with Unix permission configurations to prevent unauthorized access and maintain system integrity.",
      "videoUrl": "/videos/To-Do-Demo.mp4"
    },
    {
        "imageUrl": null,
          "title": "Wildcat Track @ NU",
          "url": "https://github.com/soj-i/OpenSM",
          "description": "This project focuses on utilizing OpenStreetMap (OSM) data to create a navigation system specifically tailored for Northwestern University's Evanston campus. The system reads and processes map data from XML documents, making it adaptable for other universities or communities. This data is used to build a graph representation of the campus, including nodes and footways, which are then leveraged to calculate optimal routes. Technologies used include C++, data structures (maps, vectors), XML parsing, and algorithms (graph traversal, shortest path).",
          "videoUrl": "/videos/OSM-Demo.mp4"
    },
    {
        "imageUrl": null,
          "title": "TunePad Tunes",
          "url": "https://tunepad.com/collection",
          "description": "As part of my volunteer work teaching computer science to 5th graders in Evanston, I developed two well-known songs using Python-styled code to create a connection between coding and music. The project was designed to introduce young students to core programming concepts in a creative and engaging way. These tunes were integrated into the TunePad Project’s website, which serves as a resource for over 300 elementary school students annually in Evanston, IL. Through this project, I helped students explore the intersection of technology and the arts, inspiring their interest in both music and computer science.",
          "videoUrl": "/videos/TunePad-Demo.mp4"
        },
        {
            "imageUrl": null,
              "title": "Virtual Masks",
              "url": "https://glitch.com/~melted-joyous-trouser",
              "description": "This project allows users to create and customize virtual masks with dynamic features using p5.js and Vue.js. The virtual masks use linear interpolation to provide smooth and responsive animations, allowing for features like adjustable particle effects, spikes, and facial overlays that react to the user’s movements. These masks are designed to be both visually engaging and highly customizable, offering a range of adjustable parameters such as mask speed, particle lifespan, and more. Leveraging p5’s drawing capabilities and Vue’s reactive components, the masks can be tailored to suit each user’s personal aesthetic, creating an experience that is both interactive and unique.",
              "videoUrl": "/videos/Virtual-Masks-Demo.mp4"
        }
  ]
}